<html>
    <body style='width: 300px', charset="utf-8" >
        <div><h1>Ohje</h1>

<b>Kortisto on</b> kirjojen ja vastaavien organisointiin tarkoitettu ohjelma.<br><br>

<b>Kortin luominen</b><br>

Klikkaa <I>Lis&auml;&auml;</I> ikkunan yl&auml;osasta. Kirjoita uuden kortin tiedot avautuneen ikkunan 
kenttiin ja paina lopuksi <I>Lis&auml;&auml;</I> uuden ikkunan alaosassa.<br><br>

<b>Huom!</b> Kahdessa eri kortissa ei voi olla t&auml;sm&auml;lleen samat nimeke- ja tekij&auml;-kent&auml;t. 
Ohjelma ei salli t&auml;llaisten korttien luomista. Kent&auml;t eiv&auml;t ole erilaisia isojen tai pienten
kirjainten perusteella, eik&auml; alussa tai lopussa olevien v&auml;lily&ouml;ntien.
Jos haluat kiert&auml;&auml; t&auml;t&auml; estoa, voit lis&auml;t&auml; v&auml;lily&ouml;ntej&auml; sanojen v&auml;liin tai lis&auml;t&auml; jonkin
tunnisteen toiseen kentt&auml;&auml;n. Esimerkiksi "Seitsem&auml;n veljest&auml; 2.p.".<br><br>

<b>Huom!</b> Mik&auml;&auml;n kortin kentt&auml; ei saa sis&auml;lt&auml;&auml; teksti&auml; ">#>#>#:::". Muuten kortisto ei tallennu oikein.
<br><br>

<b>Kortin tietojen katsominen</b><br>
Kortin katseluun on kolme tapaa:<br>
1. tuplaklikkaa korttia ikkunan alaosan korttitaulukosta<br>
2. oikeaklikkaa korttia ikkunan alaosan korttitaulukosta ja valitse <I>N&auml;yt&auml;</I> aukeavasta valikosta.<br>
3. valitse kortti alaosan korttitaulukosta ja klikkaa <I>N&auml;yt&auml;</I> ikkunan yl&auml;osasta.<br>
<br>
Pikan&auml;kym&auml;n kortin tiedoista saa my&ouml;s pit&auml;m&auml;ll&auml; hiiren osoitinta kortin p&auml;&auml;ll&auml; korttitaulukossa.<br>
<br>
Jos korttitaulukosta on valittuna useampia kortteja, mik&auml;&auml;n niist&auml; ei aukea.<br><br>

<b>Kortin muokkaaminen</b><br>
Korttia voi muokata joko valitsemalla <I>Muokkaa</I> kortinkatseluikkunassa, tai valitsemalla
p&auml;&auml;ikkunan korttitaulukosta kortin ja klikkaamalla <I>Muokkaa</I> ikkunan yl&auml;osasta tai
pikavalikosta.
<br>
Et voi muokata korttia siten, ett&auml; sen nimekkeeksi ja tekij&auml;ksi tulee t&auml;sm&auml;lleen jonkin muun
jo olemassaolevan kortin nimeke ja tekij&auml; (ks. Kortin luominen).<br><br>

<b>Kortin tuhoaminen</b><br>
Valitse tuhottavat kortit p&auml;&auml;ikkunan korttivalikosta ja klikkaa sitten <I>Tuhoa kortit</I>
ikkunan yl&auml;osasta tai <I>Tuhoa</I> hiiren oikealla n&auml;pp&auml;imell&auml; avautuvasta pikavalikosta.
<br><br>
<b>Huom!</b> Voit tuhota usean kortin kerralla, eik&auml; peruutustoimintoa ole, joten ole
varovainen.<br><br>

<b>Haku</b><br><br>
Yksinkertaisessa haussa kirjoitetaan p&auml;&auml;ikkunan yl&auml;osan hakukentt&auml;&auml;n haettava sana ja
valitaan sen j&auml;lkeen kent&auml;n oikealta puolelta <I>Hae</I>. Haku palauttaa tuloksena
jokaisen kortin, jonka johonkin kentt&auml;&auml; hakusana sis&auml;ltyy.<br><br>

Tarkempaa hakua varten klikkaa <I>Tarkka haku</I> p&auml;&auml;ikkunan yl&auml;osasta ja t&auml;yt&auml; avautuvaan
hakuikkunaan hakusanat. Haku palauttaa kortin, jos jokainen sen kentt&auml; sis&auml;lt&auml;&auml; vastaavaan
hakukentt&auml;&auml;n kirjoitetun sanan. Tyhj&auml;ksi j&auml;tettyj&auml; kentti&auml; ei oteta haussa huomioon.<br><br>

Esimerkki: Pikahaku sanoilla "Eino Leino" antaa tuloksena kirjat, joissa on tekij&auml;n&auml; Eino Leino,
mutta my&ouml;s kirjat joiden nimess&auml; on sanat "Eino Leino", kirjat joiden asiasanoina on
"Eino Leino" jne. Kirjat, joiden kirjoittaja on Eino Leino haetaan tarkalla haulla
kirjoittamalla <I>Tekij&auml;</I>-kentt&auml;&auml;n "Eino Leino" ja j&auml;tt&auml;m&auml;ll&auml; muut kent&auml;t tyhjiksi.
<br><br>

Voit tarkastella haun j&auml;lkeen kaikkia kortiston kortteja vaitsemalla p&auml;&auml;ikkunan yl&auml;osasta
<I>N&auml;yt&auml; kaikki</I>.<br><br>


<b>Tiedoston avaus ja tallennus</b><br>

Valitse yl&auml;palkista <I>Tiedosto</I>, ja sielt&auml;
<I>Uusi tiedosto</I>, <I>Avaa tiedosto</I> tai <I>Tallenna tiedosto</I>
tarpeesi mukaan. <I>Tallenna tiedosto nimell&auml;</I> mahdollistaa jo tallennetun
tiedoston tallentamisen jollakin toisella nimell&auml;.
<br><br>

<b>Pikan&auml;pp&auml;imet</b><br><br>
Lis&auml;&auml; kortti      <I>ALT + L</I><br> 
N&auml;yt&auml; kortti      <I>ALT + N</I><br> 
Muokkaa korttia   <I>ALT + M</I><br> 
Tuhoa kortit      <I>ALT + U</I><br> 
N&auml;yt&auml; kaikki      <I>ALT + K</I><br> 
Tarkka haku       <I>ALT + A</I> <br> 
Pikahaku          <I>ALT + H</I> <br> 
<br>
Uusi tiedosto     <I>CTRL + N</I> <br> 
Avaa tiedosto     <I>CTRL + O</I> <br> 
Tallenna          <I>CTRL + S</I> <br> 
<br>
Ohje              <I>CTRL + H</I> <br> 



	</div>
    </body>
</html>
